# FMarkerByClass

## Description
Function FMarkerByClass returns whether the global attributes are set to use the arrow style of the default class.

```pascal
FUNCTION FMarkerByClass : BOOLEAN;
```

```python

def vs.FMarkerByClass():
    return BOOLEAN
```

## Remarks
Returns whether the global attributes are set to use the arrow style of the default class.<BR>
[sd 8/19/98]

## Examples
```pascal
useClassMarker:=FMarkerByClass;
```

## Version
Availability: from VectorWorks8.0
## Category
* Document Attributes